app/Filters/AuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        if ($session->get('role') === 'judge') {
            $userId = $session->get('user_id');

            if (!$userId) {
                $session->remove(['user_id', 'username', 'role', 'isLoggedIn']);
                return redirect()->to('/login');
            }

            $judgeModel = new JudgeModel();
            $eventModel = new EventModel();

            $judge = $judgeModel
                ->where('user_id', $userId)
                ->get(1)
                ->getRowArray();

            if (!$judge || !isset($judge['event_id'])) {
                $session->setFlashdata('error', 'Your judge account is not linked to an event. Please contact the administrator.');
                $session->remove(['user_id', 'username', 'role', 'isLoggedIn']);
                return redirect()->to('/login');
            }

            $event = $eventModel->find($judge['event_id']);
---
SELECT *
FROM `judges`
WHERE `user_id` = '18'
 LIMIT 1
SELECT *
FROM `events`
WHERE `events`.`id` = '2'