app/Controllers/Admin.php

    public function dashboard()
    {
        // Initialize session if not started
        if (!session()->has('user_name')) {
            session()->set('user_name', 'Admin User');
        }
        $session = session();
        $success = $session->getFlashdata('success') ?? '';

        // Get active event name; if none, use the latest by ID
        $latestEventName = null;
        try {
            $eventModel = new EventModel();
            $active = $eventModel->where('is_active', 1)->orderBy('id', 'DESC')->first();
---
SELECT *
FROM `events`
WHERE `is_active` = 1
ORDER BY `id` DESC
 LIMIT 1

    public function adminHome()
    {
        // Try to use latest event name for header title
        $latestEventName = null;
        $latestEvent = null;
        $allEvents = [];
        try {
            $eventModel = new EventModel();
            $latest = $eventModel->orderBy('id', 'DESC')->first();
            if ($latest) {
                $latestEventName = $latest['name'] ?? null;
                $latestEvent = $latest;
            }
            // Fetch all events (newest first) for listing
            $allEvents = $eventModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `events`
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `events`
ORDER BY `id` DESC