app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE   (
`email` = 'diga123@gmail.com'
OR `username` = 'diga123@gmail.com'
 )
 LIMIT 1
---
    public function attemptLogin()
    {
        $request = service('request');
        $session = session();

        $identifier = trim((string) $request->getPost('identifier'));
        $password   = (string) $request->getPost('password');

        if ($identifier === '' || $password === '') {
            $session->setFlashdata('error', 'Please enter your username/email and password.');
            return redirect()->back()->withInput();
        }

        $db = \Config\Database::connect();
        $builder = $db->table('users');

        $user = $builder
            ->groupStart()
                ->where('email', $identifier)
                ->orWhere('username', $identifier)
            ->groupEnd()
            ->get(1)
            ->getRow();

SELECT *
FROM `events`
WHERE `events`.`id` = '2'
---
                return redirect()->back()->withInput();
            }

            $event = $eventModel->find($judge['event_id']);