app/Controllers/Contestant.php

    public function index()
    {
        $model = new ContestantModel();
        // Determine active event
        $eventId = null;
        try {
            $em = new \App\Models\EventModel();
            $active = $em->where('is_active', 1)->orderBy('id', 'DESC')->first();
            if ($active) {
                $eventId = (int) $active['id'];
            }
        } catch (\Throwable $e) {
            // ignore if events table missing
        }

        $contestants = $eventId ? $model->where('event_id', $eventId)->findAll() : [];
---
SELECT *
FROM `events`
WHERE `is_active` = 1
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `contestants`
WHERE `event_id` = 2

    public function store()
    {
        $model = new ContestantModel();
        // Resolve active event id
        $eventId = null;
        try {
            $em = new \App\Models\EventModel();
            $active = $em->where('is_active', 1)->orderBy('id', 'DESC')->first();
---
SELECT *
FROM `events`
WHERE `is_active` = 1
ORDER BY `id` DESC
 LIMIT 1

    public function update($id)
    {
        $model = new ContestantModel();
        // Resolve active event id to constrain updates
        $eventId = null;
        try {
            $em = new \App\Models\EventModel();
            $active = $em->where('is_active', 1)->orderBy('id', 'DESC')->first();
            if ($active) {
                $eventId = (int) $active['id'];
            }
        } catch (\Throwable $e) {}

        if (!$eventId) {
            return redirect()->to('contestant')->with('error', 'No active event.');
        }

        $id = (int) $id;
        $existing = $model->where('id', $id)->where('event_id', $eventId)->first();
---
SELECT *
FROM `events`
WHERE `is_active` = 1
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `contestants`
WHERE `id` = 9
AND `event_id` = 2
 LIMIT 1