app/Controllers/Events.php

    public function activate($id)
    {
        $session = session();
        $model = new EventModel();
        // Clear previous active
        $model->where('is_active', 1)->set(['is_active' => 0])->update();
        // Set selected active
        $updated = $model->update((int) $id, ['is_active' => 1]);
        if ($updated === false) {
            $session->setFlashdata('error', 'Failed to activate event.');
        } else {
            $event = $model->find((int) $id);
---
UPDATE `events` SET `is_active` = 0, `updated_at` = '2025-11-16 11:06:41'
WHERE `is_active` = 1
UPDATE `events` SET `is_active` = 1, `updated_at` = '2025-11-16 11:06:41'
WHERE `events`.`id` IN (1)
SELECT *
FROM `events`
WHERE `events`.`id` = 1