app/Views/layouts/template.php

SELECT *
FROM `events`
WHERE `is_active` = 1
ORDER BY `id` DESC
 LIMIT 1
---
            try {
                $em = new \App\Models\EventModel();
                // Prefer active event if present
                $active = $em->where('is_active', 1)->orderBy('id', 'DESC')->first();